Tekla.Structures.Model.SingleRebar
The SingleRebar class represents a single reinforcing bar.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
using System.Collections;
public class Example
{
public void Example1()
{
Beam Beam = new Beam(new Point(5000, 7000, 0), new Point(6000, 7000, 0));
Beam.Profile.ProfileString = "250*250";
Beam.Material.MaterialString = "K40-1";
Beam.Finish = "PAINT";
Beam.Insert();
double MinimumY = Beam.GetSolid().MinimumPoint.Y;
double MinimumX = Beam.GetSolid().MinimumPoint.X;
double MinimumZ = Beam.GetSolid().MinimumPoint.Z;
double MaximumY = Beam.GetSolid().MaximumPoint.Y;
double MaximumX = Beam.GetSolid().MaximumPoint.X;
double MaximumZ = Beam.GetSolid().MaximumPoint.Z;
Polygon Polygon = new Polygon();
Polygon.Points.Add(new Point(MinimumX, MaximumY, MaximumZ));
Polygon.Points.Add(new Point(MaximumX, MaximumY, MaximumZ));
SingleRebar SingleRebar = new SingleRebar();
SingleRebar.Polygon = Polygon;
SingleRebar.Father = Beam;
SingleRebar.Name = "SingleRebar";
SingleRebar.Class = 9;
SingleRebar.Size = "12";
SingleRebar.NumberingSeries.StartNumber = 0;
SingleRebar.NumberingSeries.Prefix = "Single";
SingleRebar.Grade = "A500HW";
SingleRebar.OnPlaneOffsets = new ArrayList();
SingleRebar.OnPlaneOffsets.Add(25.00);
SingleRebar.StartHook.Angle = -90;
SingleRebar.StartHook.Length = 10;
SingleRebar.StartHook.Radius = 10;
SingleRebar.StartHook.Shape = RebarHookData.RebarHookShapeEnum.CUSTOM_HOOK;
SingleRebar.EndHook.Angle = 90;
SingleRebar.EndHook.Length = 10;
SingleRebar.EndHook.Radius = 10;
SingleRebar.EndHook.Shape = RebarHookData.RebarHookShapeEnum.CUSTOM_HOOK;
if(!SingleRebar.Insert())
Console.WriteLine("Insert failed!");
}
}

Tekla.Structures.Model.SingleRebar.Size
The size of the reinforcement.

Tekla.Structures.Model.SingleRebar.StartHook
The hook at the beginning of the reinforcing bar.

Tekla.Structures.Model.SingleRebar.EndHook
The hook at the end of the reinforcing bar.

Tekla.Structures.Model.SingleRebar.Polygon
The polygon of the reinforcing bar.

Tekla.Structures.Model.SingleRebar.#ctor
Initializes a new single rebar instance with empty attributes.

Tekla.Structures.Model.SingleRebar.Insert
Inserts the single rebar into the model database. All the attributes must be set.
Returns: True on success.

Tekla.Structures.Model.SingleRebar.Select
Selects a single rebar from the model database. The reinforcement identifier must be set.
Returns: True on success.

Tekla.Structures.Model.SingleRebar.Modify
Modifies the existing single rebar in the model database to match the current one.
Returns: True on success.

Tekla.Structures.Model.SingleRebar.Delete
Deletes the single rebar instance with the given identifier from the model database.
Returns: True on success.

Tekla.Structures.Model.SingleRebar.GetRebarSet
Gets the parent Tekla.Structures.Model.RebarSet of the single rebar.
Returns: The parent Tekla.Structures.Model.RebarSet, or null if no parent rebar set.